DoublyCenteredCLIP(
  (image_encoder): MLP(
    (proj): Linear(in_features=512, out_features=256, bias=True)
    (layers): ModuleList(
      (0): Linear(in_features=256, out_features=256, bias=True)
    )
    (out): Linear(in_features=256, out_features=128, bias=True)
  )
  (text_encoder): MLP(
    (proj): Linear(in_features=512, out_features=256, bias=True)
    (layers): ModuleList(
      (0): Linear(in_features=256, out_features=256, bias=True)
    )
    (out): Linear(in_features=256, out_features=128, bias=True)
  )
)
