MiniCLIP(
  (image_encoder): MLP(
    (proj): Linear(in_features=512, out_features=64, bias=True)
    (layers): ModuleList(
      (0): Linear(in_features=64, out_features=64, bias=True)
    )
    (out): Linear(in_features=64, out_features=32, bias=True)
  )
  (text_encoder): MLP(
    (proj): Linear(in_features=512, out_features=64, bias=True)
    (layers): ModuleList(
      (0): Linear(in_features=64, out_features=64, bias=True)
    )
    (out): Linear(in_features=64, out_features=32, bias=True)
  )
)
